print('Завдання:') 
print('равлик рухається по вертикальній жередині, піднімаючись за день- ')
print('на 7 метрів')
print('а за ніч спускається на 2')
print('скільки діб має пройти щоб равлик опинився на верхівці жередини висотою 15 метрів')
print('')
print('7+7+7-2-2-2=15=3 дні')
a = int(input('на скільки метрів равлик підіймається? - '))
b = int(input('на скільки метрів равлик опускається? - '))
h = int(input('яка висота жередини? - '))
print('Відповідь')
if (a > b):
    print('На верхівці равлик опинеться через ', round(h / (a - b)), ' діб.')
else:
    print('Равлик на верхівку не виповзе')
input()

